package org.example.prof.lessonEleven.homeWorkEleven.taskOneSpider;

public class GameMain {
/*
  1) Игра пасьянс :

   Создать колоду карт и наполнить ее картами.(Можно карты взять из ранней домашней с картами)
   Написать приложение которое будет при запуске перемешивать колоду карт.
   И раскладывать ее в стопку - если в стопке две карты одной масти ложатся друг на друга, то их убираем из стопки.
   В конце написать результат и вывести карты в стопке.
   Пасьянс сошелся если осталось по 1 карте каждой масти (число карт каждой масти нечетное).
*/
    public static void main(String[] args) {
        CardDeck cardDeck = new CardDeck();
    }
}







